[
  {
    "Author": "Sara Buenfeld",
    "Cook Time": "2 hrs",
    "Description": "A whole poached salmon makes a buffet centrepiece with wow-factor - we've got ideas for using up the leftovers too",
    "Difficulty": "Easy",
    "Image Link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1274467_8-67a0abd.jpg?quality=90&resize=440,400",
    "Ingredients": "3 ?kg whole salmon (ask your fishmonger to clean and gut it)| olive oil| for greasing| 1 small onion| very thinly sliced| 4 bay leaves| 20g pack dill| 6 tbsp dry white wine| 3 ripe avocados| preferably Hass| 200ml mayonnaise| zest and juice 1 large lemon| ? cucumber| peeled| deseeded and diced| bunch watercress| lemon wedges| thick cucumber slices| fresh dill (optional)",
    "Instructions": "Heat oven to 150C/fan 130C/gas 2. Put the salmon on a large sheet of oiled extra-wide foil (this will stop it from sticking later). Put the onion, bay leaves and half the dill in the body cavity, spoon over the wine, season with salt and black pepper, then loosely bring the foil round the salmon and seal well to make a parcel. Lift onto a baking tray, then bake for 2 hrs. Take from the oven, then leave to cool for about 10 mins, still in its parcel., Meanwhile, whizz the flesh from the avocados (with a hand blender or in a food processor) with the mayo, lemon juice, zest and seasoning. Tip into a bowl. Chop the remaining dill, stir in with the cucumber, then transfer to a serving bowl. Chill for up to 3 hrs., Unwrap the salmon, then strip away the skin and fins. Personally, I don??t take the skin from the bottom of the fish if I am serving the salmon warm, as you risk breaking the fish up as you turn it over. It is more robust when it is cold, so in this case remove the skin from both sides. You can leave the head on or take off at this stage. Carefully lift onto a platter, then garnish with watercress, cucumber, lemon wedges and dill, if using., To serve, remove the fish in chunky fillets. When all the fish has gone from the top fillet, remove the onion and herb flavouring, pull away the bones, then remove portions of the bottom fillet, leaving the skin behind. Eat with the avocado mayo, warm buttery new potatoes, and salads or green beans.",
    "Nutrition Info": "0",
    "Prep Time": "20 mins",
    "Rating": 0,
    "Ratings Count": 7,
    "Recipe Name": "Foil-poached salmon with dill & avocado mayo",
    "Servings": 0,
    "url": 108
  },
  {
    "Author": "Good Food team",
    "Cook Time": "15 mins",
    "Description": "Add some oomph to white fish with salsa and avocado - it'll remind you of Mediterranean nights",
    "Difficulty": "Easy",
    "Image Link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-2092_11-6a84a35.jpg?quality=90&resize=440,400",
    "Ingredients": "1 ripe avocado| 2 ripe plum  tomatoes| each chopped into 6| 1 small red onion| finely sliced| 3 tbsp  olive oil| plus some for drizzling| juice half a lemon or 1  lime| small bunch  coriander| leaves only| 2 x 140g/6oz fish fillets| such as Pacific  cod  or halibut| skin on",
    "Instructions": "Halve and stone the avocado and use a teaspoon to scoop chunks of the flesh into a bowl. Gently mix all the other ingredients, except the fish, in with the avocado, then set aside., Heat a griddle pan until very hot. Season the fish with pepper, and salt if you want, then drizzle with a little olive oil. Griddle the fillets for 2-3 mins on each side until charred and cooked through. Serve with the avocado salad.",
    "Nutrition Info": "0",
    "Prep Time": "10 mins",
    "Rating": 0,
    "Ratings Count": 8,
    "Recipe Name": "Grilled fish with chunky avocado salsa",
    "Servings": 0,
    "url": 136
  },
  {
    "Author": "Cassie Best",
    "Cook Time": "10 mins",
    "Description": "Pack in the flavour and lots of veg in this easy fish tacos recipe. It's an easy way to get your family eating more fish, and one portion counts as three of their 5-a-day",
    "Difficulty": "Easy",
    "Image Link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/08/Fish-Tacos-1337495.jpg?quality=90&resize=556,505",
    "Ingredients": "1 tsp ground cumin| 1 tsp ground coriander| 2 tsp smoked paprika| 2 limes| 500g white fish fillets| such as cod| haddock| pollack or tilapia| skin and bones removed| ? red cabbage| 2 large tomatoes| 2 large avocados| 2 tbsp vegetable oil| 8 small corn or wheat tortilla wraps| small bunch coriander| chopped| 1 green chilli| finely sliced| optional | 100g soured cream| chilli sauce| to serve",
    "Instructions": "Combine the cumin, coriander, paprika and a generous pinch of salt in a large bowl, add the juice from 1 lime and mix well. Toss the fish fillets in the spiced lime paste and set aside while you prepare the salad., Finely slice the cabbage ?? you can do this by hand or in a food processor if you want it really fine ?? squeeze over the juice from half a lime and season with a little salt, scrunch the salt and lime into the cabbage and set aside. Chop the tomatoes into small pieces. Stone the avocado, scoop out the soft inside and slice, or if it??s a very ripe avocado you may want to mash it in a bowl with a little lime and salt. Keep all the salad ingredients separate on a board., Heat the grill to high. Line a baking tray with foil and brush with a little oil, place the fish fillets on the tray, pour over any paste from the bowl and brush with a little more oil. Cook the fish close to the grill for 8-10 mins until the fish is cooked and starting to scorch in places, to check its cooked, gently push one of the fillets, it should easily flake when cooked., If you have a gas hob, warm the tortillas directly over the flames with a pair of tongs for a charred finish. Alternatively, wrap in foil and warm in the oven on the shelf beneath the fish., To serve, spread a little soured cream over each warm tortilla, top with a handful of cabbage, some tomatoes and a few slices of avocado. Flake the fish and add a few big chunks to each tortilla then top with coriander, chilli and chilli sauce.",
    "Nutrition Info": "0",
    "Prep Time": "20 mins",
    "Rating": 0,
    "Ratings Count": 3,
    "Recipe Name": "Fish tacos",
    "Servings": 0,
    "url": 203
  },
  {
    "Author": "Sara Buenfeld",
    "Cook Time": "15 mins",
    "Description": "Top white fish with tomato salsa, avocado, tortilla chips and coriander for a quick midweek supper",
    "Difficulty": "Easy",
    "Image Link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/cod-6d23913.jpg?quality=90&resize=440,400",
    "Ingredients": "4 chunky skinless  white fish fillets| such as cod or haddock (approx 500g)| 226g jar mild salsa| 85g mature cheddar| grated| 1 large  avocado| stoned| peeled and diced| juice 1 lime| small pack  coriander| chopped| 50g tortilla chip (or gluten-free alternative)| brown rice and salad| to serve",
    "Instructions": "Heat oven to 220C/200C fan/gas 7. Arrange the fish on the base of a shallow ovenproof dish, then spoon the salsa on top. Scatter with the cheese and bake for 15 mins or until the fish flakes when tested with the point of a knife., Meanwhile, stir the avocado with the lime juice, coriander and seasoning. Spoon it over the cooked fish, then scatter with the tortillas, lightly crushing them as you go. Serve with brown rice (we used pre-cooked microwave pouches to save time) and salad.",
    "Nutrition Info": "0",
    "Prep Time": "5 mins",
    "Rating": 0,
    "Ratings Count": 15,
    "Recipe Name": "Crunchy salsa cod",
    "Servings": 0,
    "url": 209
  },
  {
    "Author": "John Torode",
    "Cook Time": "30 mins",
    "Description": "John Torode's Mexican-inspired one-pot casserole is packed with shellfish, white fish and plenty of chilli",
    "Difficulty": "Easy",
    "Image Link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-932567_11-ab045d0.jpg?quality=90&resize=440,400",
    "Ingredients": "2 dried ancho or guajillo chillies| 1 tbsp olive oil| 1 large onion| chopped| 4 garlic cloves| chopped| 1 tsp chipotle paste or 1 tsp smoked hot paprika (pimentón)| 1 tsp ground cumin| 700ml chicken stock| 250g chopped tomato| from a can| 200g large peeled raw  prawn| 300g halibut or other firm white fish fillets| cut into 2.5cm pieces| 300g clam| 500g small new potato| halved and boiled| juice 2  limes| lime wedges| 1 avocado| chopped| handful  coriander leaves| 1 small red onion| finely diced| corn tortillas| sliced and baked",
    "Instructions": "Toast the chillies in a hot dry frying pan for a few moments (they will puff up a bit), then remove. Deseed and stem chillies, and soak in boiling water for 15 mins., Heat the olive oil in a large saucepan over a medium heat. Add the onion and garlic, season and cook for about 5 mins or until softened. Add the chipotle paste, reconstituted chillies, cumin, stock and tomatoes. Sauté for 5 mins, then purée until very fine in a blender. Pour back into the pan and bring to the boil. Reduce the heat and simmer for 10 mins. When close to eating, add the prawns, fish fillets, clams and potatoes. Place a lid on top and cook for 5 mins over a medium-high heat. Add the lime juice and serve with lime wedges, avocado, coriander, red onion and tortilla chips for sprinkling over.",
    "Nutrition Info": "0",
    "Prep Time": "15 mins",
    "Rating": 0,
    "Ratings Count": 35,
    "Recipe Name": "Spicy seafood stew with tomatoes & lime",
    "Servings": 0,
    "url": 237
  },
  {
    "Author": "Jane Hornby",
    "Cook Time": "30 mins",
    "Description": "Thai-inspired chicken makes a perfect barbecue dish, serve with a feast of dressed green salad and herbs",
    "Difficulty": "Easy",
    "Image Link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/july-salad-c994666.jpg?quality=90&resize=440,400",
    "Ingredients": "zest and juice 3 limes| 3 tbsp fish sauce| 3 tbsp soft light brown sugar| 2 hot  red chillies| thinly sliced (see tip| below)| 1 tbsp extra virgin olive oil| 2 garlic cloves| crushed| 1 tsp turmeric| handful coriander stems| finely chopped| 8 chicken leg or thigh pieces| skin on| bunch  spring onion| shredded lengthways| ? cucumber| halved| deseeded and cut into long strips| 200g baby tomato| halved| handful  coriander| handful Thai basil leaves| 2 ripe avocados| sliced| handful toasted cashews or peanuts",
    "Instructions": "Whisk together the lime zest and juice, fish sauce, sugar and chillies until the sugar dissolves. Pour 1/3 of this mix into a bowl, add the oil and set aside (this will be the dressing). Put the remainder into a large food bag with 1 tsp salt, the garlic, turmeric and coriander stems. Slash each piece of chicken down to the bone a few times, then add to the marinade and squish it around well in the bag. Chill for at least 2 hrs, or ideally up to 24 hrs., Heat oven to 180C/160C fan/gas 4 (if barbecuing, get the coals ready). Lift the chicken from the marinade and into a roasting tin. Roast for 30 mins until cooked through but not yet completely tender., If you??re barbecuing, transfer the chicken from its tin to a hot barbecue for 10 mins more, turning once crisp (otherwise continue roasting in the oven). Spread the spring onions, cucumber and tomatoes over a platter, add the chicken, then finish with the herbs, avocados, nuts and dressing.",
    "Nutrition Info": "0",
    "Prep Time": "15 mins",
    "Rating": 0,
    "Ratings Count": 19,
    "Recipe Name": "Chilli-lime chicken salad",
    "Servings": 0,
    "url": 242
  }
]